[
	{
		"title": "Hello World!",
		"image": "#",
		"content":  "<p class=\"indent\">Hello and welcome to my site.  Here you will find tips and tricks, rants and raves, and various doodads to keep your mind wandering.  It is my sincerest wish that this site will not only showcase my abilities as a programmer, but will also show you who I am as a person.  With that in mind I want to emphasize that this is a personal site, and I will be expressing myself to the fullest of my capabilities. All, while staying out of correctional facilities.  So sit back, relax, butter up some popcorn and stay a while.</p>"	 
	},
	{
		"title": "Ode to SF3",
		"content":"<img src=\"../resources/img_0.jpg\" alt=\"Street Fighter 3 Third Strike logo\"><br><p class=\"indent\">Its hard to describe how good this game is.  Yes it axed many of the beloved SF2 characters, yes it redefined core mechanics, yes it had balancing issues.  But despite all this, no other street fighter even came close to surpassing it.  The game was incredibly polished, and had a level of personality that just oozed out from every seam.  The soundtrack, the character sprites, and the overall feel of the game had an incredible amount of detail.  Something that newer games fail to capture.  To put it simply SF3 had soul and style, and to this day stands out as a masterpiece in an ocean of the bland and mediocre.</p><a class=\"more\" href=\"/app/views/home.html#/post/1\" onclick=\"play()\">Read on</a>" ,
		"readmorelink":"button sound",
		"content_e":"<p class=\"indent\">Its hard to describe how good this game is. Yes it axed many of the beloved SF2 characters, yes it redefined core mechanics, yes it had balancing issues. But despite all this, no other street fighter even came close to surpassing it. The game was incredibly polished, and had a level of personality that just oozed out from every seam. The soundtrack, the character sprites, and the overall feel of the game had an incredible amount of detail. Something that newer games fail to capture. To put it simply SF3 had soul and style, and to this day stands out as a masterpiece in an ocean of the bland and mediocre. <p><br> <p class=\"indent\">Visually SF3 is stunning, the level of detail on each animation enriches the experience, and gives each character that much more personality. Maybe I’m just too old school, but I really think the pixel sprites convey more emotion than any 3D rendered model.  Each animation , while giving their respective character that much more personality. To this day I’m still finding new animations whenever I play.</p></br> //insert makoto getting hit by mouse cursor // link to zweifus <p class=\"indent\">In addition to the amazing visuals, the game offered an incredible soundtrack. Yoshinori Ono really outdid himself on this one. From the character select screen to the ending credits, every composition was a hit. The Jazzy/ Hip Hop themed music really complemented the smoothness and fluidity of the game, as well as its slick looks. On top of this the voice acting was superb. I was extremely impressed with Capcom, especially given their history.//insert mega man 8 link. Every character was fun to listen to. Their banter and the way they said it ((You have no dignity)) really stand out and add to the overall experience.</p><br> <p class=\"indent\">Aesthetically this game is no doubt pretty, but its gameplay and some of the decisions the designers made with this iteration will always be hotly debated. The biggest being the parry system. Many felt this new addition rewarded randomness, and took away from what SF was about. I found this change to be liberating, and one of the main reasons why this game was so much fun to play. For those of you who don’t know the parry system gives the player a chance to nullify attacks by performing the parry action, (tapping forward/down) right as the character is about to be hit. The concept is pretty easy to understand.</p><br> <img class=\"Q\"height=\"200px\" src=\"../resources/Q_Parry.gif\"><br> <p class=\"indent\">The window in which you can perform a parry is tight and strict, so this really isn’t something you can mash out and expect to work. The Parry system offers a high risk high reward functionality. If you miss the parry or guess wrong, you will eat big damage. Guess right, and you can turn the tide of the battle. </p><br><iframe height=\"420\" width=\"600\" src=\"https://www.youtube.com/embed/Lq1ey4-ewyQ\" frameborder=\"0\" allowfullscreen></iframe><br><p class=\"indent\">Parries take an incredible amount of skill, not just in terms of timing, but also because it requires you to make reads on your opponent. It keeps players honest, as they cant rely on the same thing over and over again since a well timed parry will counter it. It caters to creativity, and really makes every match unique. This doesn’t mean parrying is useful in every situation, in fact often times people will try and bait out parries so that they can get the advantage in certain scenarios. Take the following.</p><br> //insert Dudley jump in <p class=\"indent\">Parries added another level of play in SF3, and also made skill gaps that much more apparent, which was also one of the games biggest critiques. The learning curve was steep, and because of the incredible amount of depth this mechanic added it often overwhelmed newer players. But like anything in life, you cant just expect to play like a pro the minute you get the game. Which brings me to one of my biggest pet peeves of games today, everything is made and designed for newer players. Meaning that skill is often capped, and improvement comes in the form of mastering technical execution, as opposed to strategizing and creating new ways to achieve victory. Don’t get me wrong, there will always be an execution barrier no matter what SF you play, but it should never be the emphasis of the game. In my opinion I believe true skill should be measured by how well you can exert your will over the game, which is why parries offer a limitless skill cap. In any situation, no matter how grim, there is always a chance, and that’s what I love most about SF3. </p><br> <p class=\"indent\">I could go on talking about the technical details but this isn’t a scientific Journal, so to keep things brief I’d like to talk about its impact on fighting games as a whole today. Despite all its criticism, and all its complaints SF3 was ahead of its time. The newest iteration of SF4, uses the same EX mechanics, throw mechanics, and selectable supers that SF3 created. It has been announced that parries, the most controversial part of SF3, will make a return in SF5. The game redefined the competitive fighting scene, and paved the way for others to come. To this day the Daigo Parry (vid above) is the most popular SF moment in the history of competitive fighting and in the franchise of Street Fighter. It is the one moment that any casual fighting game enthusiast knows about, and is part of the reason why fighting games today are so much fun to watch. </p><br> <p class=\"indent\">SF3 shook things up and challenged the status quo, which is never an easy task. It was new and original, and for that alone I’d like to thank everyone who took part in making it a reality. Never was their a dull moment playing this game, and never do I regret all the time I spent learning/ playing it and the people I‘ve met doing so. SF3 will always hold a special place in my heart no matter how many additions they add to the series. It will always stand out as a fine example of a quality game, but don’t take my word for it, go out there and try it yourself. I recommend downloading fight Cade to play it, you may even find me on there. Till then, WE AWAIT YOUR RETURN WARRIOR!</p> "
	}
]
